---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WorksetConfiguration
source: html/d3fa498f-5d2e-b5d0-5555-d373f289ebfc.htm
---
# WorksetConfiguration Members

Constructs a new workset configuration with an initial setting to open all user-created worksets.